src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_HTTPМетодAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_СпособПолученияДанныхAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетодаОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторТипИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ТипИсточникаКонструктораAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторОтборыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ФорматОтветаAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONПараметрыЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСопоставления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МС_СпособСопоставленияПараметраОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТестовыеЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_HTTPМетодAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_HTTPМетодAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELETE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PATCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HEAD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OPTIONS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_ФорматОтветаAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_ФорматОтветаAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_СпособПолученияДанныхAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_СпособПолученияДанныхAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекстЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммныйМодуль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_ТипИсточникаКонструктораAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_ТипИсточникаКонструктораAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.HTTPМетод) Тогда
			Объект.HTTPМетод = Перечисления.МС_HTTPМетодAPI.GET;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ФорматОтвета) Тогда
			Объект.ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СпособПолученияДанных) Тогда
			Объект.СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КонструкторТипИсточника) Тогда
			Объект.КонструкторТипИсточника = Перечисления.МС_ТипИсточникаКонструктораAPI.Справочник;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораСравненияОтбора();
	ЗагрузитьКонструкторИзОбъектаНаСервере();
	ОбновитьСпискиВыбораКонструктораНаСервере();
	ОбновитьПредпросмотрИмениТаблицыНаСервере();
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	МС_HTTPAPIСервер.СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(Объект);
	ЗаполнитьСпискиВыбораПараметровЗаписиJSONНаСервере();
	ЗагрузитьПараметрыЗаписиJSONВФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗагрузитьКонструкторИзОбъектаНаСервере();
	ОбновитьСпискиВыбораКонструктораНаСервере();
	ОбновитьПредпросмотрИмениТаблицыНаСервере();
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	МС_HTTPAPIСервер.СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ТекущийОбъект);
	ЗагрузитьПараметрыЗаписиJSONВФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON Тогда
		ПрименитьПараметрыЗаписиJSONИзФормыКОбъекту(ТекущийОбъект);
	КонецЕсли;
	
	Если ТекущийОбъект.СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		МС_HTTPAPIКонструкторСервер.ПрименитьМастерКонструкторуКОбъекту(ТекущийОбъект, ПоляКонструктора, ОтборыКонструктора);
		МС_HTTPAPIСервер.ЗаполнитьПараметрыЗапросаИзОтборовКонструктораПоJSON(ТекущийОбъект);
	ИначеЕсли ТекущийОбъект.СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса Тогда
		МС_HTTPAPIСервер.ПроверитьСоответствиеПараметровИТекстаЗапроса(ТекущийОбъект.ТекстЗапроса, ТекущийОбъект.ПараметрыЗапроса);
	КонецЕсли;
	
	МС_HTTPAPIСервер.СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьПоСпособуИФормату();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособПолученияДанныхПриИзменении(Элемент)
	
	СпособПолученияДанныхПриИзмененииНаСервере();
	УстановитьВидимостьПоСпособуИФормату();
	
КонецПроцедуры

&НаСервере
Процедура СпособПолученияДанныхПриИзмененииНаСервере()
	
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматОтветаПриИзменении(Элемент)
	
	ФорматОтветаПриИзмененииНаСервере();
	УстановитьВидимостьПоСпособуИФормату();
	
КонецПроцедуры

&НаСервере
Процедура ФорматОтветаПриИзмененииНаСервере()
	
	Если Объект.ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON Тогда
		ЗагрузитьПараметрыЗаписиJSONВФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторТипИсточникаПриИзменении(Элемент)
	
	КонструкторТипИсточникаПриИзмененииНаСервере();
	УстановитьВидимостьПоСпособуИФормату();
	
КонецПроцедуры

&НаСервере
Процедура КонструкторТипИсточникаПриИзмененииНаСервере()
	
	Объект.КонструкторИмяОбъекта = "";
	Объект.КонструкторИмяТабличнойЧасти = "";
	ОбновитьСпискиВыбораКонструктораНаСервере();
	ОбновитьПредпросмотрИмениТаблицыНаСервере();
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторИмяОбъектаПриИзменении(Элемент)
	
	КонструкторИмяОбъектаПриИзмененииНаСервере();
	УстановитьВидимостьПоСпособуИФормату();
	
КонецПроцедуры

&НаСервере
Процедура КонструкторИмяОбъектаПриИзмененииНаСервере()
	
	Объект.КонструкторИмяТабличнойЧасти = "";
	ОбновитьСпискиВыбораКонструктораНаСервере();
	ОбновитьПредпросмотрИмениТаблицыНаСервере();
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторИмяТабличнойЧастиПриИзменении(Элемент)
	
	КонструкторИмяТабличнойЧастиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонструкторИмяТабличнойЧастиПриИзмененииНаСервере()
	
	ОбновитьПредпросмотрИмениТаблицыНаСервере();
	ОбновитьСписокВыбораПоляОтбораКонструктораНаСервере();
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекстКонструктораПриИзменении(Элемент)
	
	УстановитьВидимостьПоСпособуИФормату();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораПриИзменении(Элемент)
	
	ОтборыКонструктораПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораПолеПриИзменении(Элемент)
	
	ОтборыКонструктораПолеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтборыКонструктораПолеПриИзмененииНаСервере()
	
	ТекДанные = Элементы.ОтборыКонструктора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.ЗначениеКонстанты = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораЗначениеКонстантыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ОтборыКонструктора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекДанные.Поле) Тогда
		ПоказатьПредупреждение(, "Сначала выберите поле отбора.");
		Возврат;
	КонецЕсли;
	
	ОТ = ОписаниеТипаПоляОтбораКонструктораНаСервере(ТекДанные.Поле);
	Если ОТ = Неопределено Или ОТ.Типы().Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не удалось определить тип поля по метаданным. Введите значение вручную в ячейке.");
		Возврат;
	КонецЕсли;
	
	НачальноеЗначение = Неопределено;
	Если ЗначениеЗаполнено(СокрЛП(ТекДанные.ЗначениеКонстанты)) Тогда
		НачальноеЗначение = ЗначениеОтбораИзСтрокиКонстантыНаСервере(ТекДанные.Поле, ТекДанные.ЗначениеКонстанты);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОтборыКонструктораЗначениеКонстантыПослеВвода", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение, НачальноеЗначение, "Значение отбора (фикс.)", ОТ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораЗначениеКонстантыПослеВвода(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элементы.ОтборыКонструктора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.ЗначениеКонстанты = СтрокаКонстантыОтбораПослеВводаНаСервере(Результат);
	ОтборыКонструктораПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОписаниеТипаПоляОтбораКонструктораНаСервере(ИмяПоля)
	
	ИмяТаблицы = МС_HTTPAPIКонструкторСервер.ПолноеИмяТаблицыЗапроса(Объект.КонструкторТипИсточника, Объект.КонструкторИмяОбъекта, Объект.КонструкторИмяТабличнойЧасти);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) И ЗначениеЗаполнено(Объект.КонструкторИмяТаблицы) Тогда
		ИмяТаблицы = СокрЛП(Объект.КонструкторИмяТаблицы);
	КонецЕсли;
	Возврат МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ИмяТаблицы, ИмяПоля);
	
КонецФункции

&НаСервере
Функция ЗначениеОтбораИзСтрокиКонстантыНаСервере(ИмяПоля, СтрокаКонстанты)
	
	ОТ = ОписаниеТипаПоляОтбораКонструктораНаСервере(ИмяПоля);
	Возврат МС_HTTPAPIКонструкторСервер.ЗначениеИзСтрокиПоОписаниюТипов(ОТ, СтрокаКонстанты);
	
КонецФункции

&НаСервере
Функция СтрокаКонстантыОтбораПослеВводаНаСервере(Значение)
	
	Возврат МС_HTTPAPIКонструкторСервер.СтрокаКонстантыОтбораДляСохранения(Значение);
	
КонецФункции

&НаСервере
Процедура ОтборыКонструктораПриИзмененииНаСервере()
	
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестВыполнения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Запишите элемент справочника перед тестом.");
		Возврат;
	КонецЕсли;
	
	РезультатПросмотра = ТестВыполненияНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПример(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Запишите элемент справочника перед формированием примера.");
		Возврат;
	КонецЕсли;
	
	РезультатПросмотра = СформироватьПримерНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗаполнитьПоляИзМетаданных(Команда)
	
	КонструкторЗаполнитьПоляИзМетаданныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыИзТекстаЗапроса(Команда)
	
	Если Объект.СпособПолученияДанных <> ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.ТекстЗапроса") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыИзТекстаЗапросаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыИзОтборовКонструктора(Команда)
	
	Сообщение = ЗаполнитьПараметрыИзОтборовКонструктораНаСервере();
	Если ЗначениеЗаполнено(Сообщение) Тогда
		ПоказатьПредупреждение(, Сообщение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеИнтерфейсом

&НаКлиенте
Процедура УстановитьВидимостьПоСпособуИФормату()
	
	Способ = Объект.СпособПолученияДанных;
	ЭтоТекстЗапроса = (Способ = ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.ТекстЗапроса"));
	ЭтоПрограммный = (Способ = ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.ПрограммныйМодуль"));
	ЭтоКонструктор = (Способ = ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.Конструктор"));
	
	Элементы.ТекстЗапроса.Видимость = ЭтоТекстЗапроса;
	Элементы.ТекстЗапроса.Доступность = ЭтоТекстЗапроса;
	
	Элементы.ИмяМетодаОбработчика.Видимость = ЭтоПрограммный;
	Элементы.ИмяМетодаОбработчика.Доступность = ЭтоПрограммный;
	
	Элементы.ГруппаКонструкторМастер.Видимость = ЭтоКонструктор;
	Элементы.ПоляКонструктора.Видимость = ЭтоКонструктор;
	Элементы.ОтборыКонструктора.Видимость = ЭтоКонструктор;
	Элементы.ПоказатьТекстКонструктора.Видимость = ЭтоКонструктор;
	
	ТипИсточника = Объект.КонструкторТипИсточника;
	НужнаТЧ =
		ЭтоКонструктор
		И (ТипИсточника = ПредопределенноеЗначение("Перечисление.МС_ТипИсточникаКонструктораAPI.Справочник")
			Или ТипИсточника = ПредопределенноеЗначение("Перечисление.МС_ТипИсточникаКонструктораAPI.Документ"));
	Элементы.КонструкторИмяТабличнойЧасти.Видимость = НужнаТЧ;
	Элементы.КонструкторИмяТабличнойЧасти.Доступность = НужнаТЧ;
	
	ПоказатьТекст = ЭтоКонструктор И ПоказатьТекстКонструктора;
	Элементы.ГруппаКонструкторТекст.Видимость = ПоказатьТекст;
	Элементы.ГруппаКонструкторТекст.Доступность = ПоказатьТекст;
	
	Элементы.ЛимитСтрок.Видимость = ЭтоКонструктор;
	Элементы.ЛимитСтрок.Доступность = ЭтоКонструктор;
	
	ЭтоJSON = (Объект.ФорматОтвета = ПредопределенноеЗначение("Перечисление.МС_ФорматОтветаAPI.JSON"));
	Элементы.ГруппаПараметрыЗаписиJSON.Видимость = ЭтоJSON;
	Элементы.ГруппаПараметрыЗаписиJSON.Доступность = ЭтоJSON;
	
	Элементы.ГруппаПараметрыHTTP.Видимость = ЭтоТекстЗапроса Или ЭтоПрограммный Или ЭтоКонструктор;
	Элементы.ГруппаПараметрыHTTP.Доступность = ЭтоТекстЗапроса Или ЭтоПрограммный Или ЭтоКонструктор;
	
	Элементы.ПараметрыЗапросаТипПараметра.Видимость = ЭтоТекстЗапроса Или ЭтоПрограммный Или ЭтоКонструктор;
	ПараметрыHTTPАктивны = ЭтоТекстЗапроса Или ЭтоПрограммный Или ЭтоКонструктор;
	Элементы.ПараметрыЗапросаСпособСопоставления.Видимость = ПараметрыHTTPАктивны;
	Элементы.ПараметрыЗапросаСпособСопоставления.Доступность = ПараметрыHTTPАктивны;
	Элементы.ПараметрыЗапросаСпособСопоставления.ТолькоПросмотр = Ложь;
	Элементы.ПараметрыЗапросаИсточник.Видимость = ЭтоПрограммный;
	
	Элементы.ПараметрыЗапросаЗаполнитьИзТекста.Видимость = ЭтоТекстЗапроса;
	Элементы.ПараметрыЗапросаЗаполнитьИзТекста.Доступность = ЭтоТекстЗапроса;
	
	Элементы.ПараметрыЗапросаЗаполнитьИзОтборов.Видимость = ЭтоКонструктор;
	Элементы.ПараметрыЗапросаЗаполнитьИзОтборов.Доступность = ЭтоКонструктор;
	
	Элементы.ПараметрыЗапросаИмяПараметра.ТолькоПросмотр = ЭтоКонструктор;
	Элементы.ПараметрыЗапросаТипПараметра.ТолькоПросмотр = ЭтоКонструктор;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьКонструкторИзОбъектаНаСервере()
	
	МС_HTTPAPIКонструкторСервер.ЗагрузитьКонструкторВТаблицыФормы(Объект, ПоляКонструктора, ОтборыКонструктора);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредпросмотрИмениТаблицыНаСервере()
	
	Имя = МС_HTTPAPIКонструкторСервер.ПолноеИмяТаблицыЗапроса(Объект.КонструкторТипИсточника, Объект.КонструкторИмяОбъекта, Объект.КонструкторИмяТабличнойЧасти);
	Если ЗначениеЗаполнено(Имя) Тогда
		ПредпросмотрИмениТаблицы = Имя;
	ИначеЕсли ЗначениеЗаполнено(Объект.КонструкторИмяТаблицы) Тогда
		ПредпросмотрИмениТаблицы = Объект.КонструкторИмяТаблицы;
	Иначе
		ПредпросмотрИмениТаблицы = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиВыбораКонструктораНаСервере()
	
	Элементы.КонструкторИмяОбъекта.СписокВыбора.Очистить();
	СписокОбъектов = МС_HTTPAPIКонструкторСервер.СписокОбъектовПоТипу(Объект.КонструкторТипИсточника);
	Для Каждого Эл Из СписокОбъектов Цикл
		Элементы.КонструкторИмяОбъекта.СписокВыбора.Добавить(Эл.Имя, Эл.Представление);
	КонецЦикла;
	
	Элементы.КонструкторИмяТабличнойЧасти.СписокВыбора.Очистить();
	СписокТЧ = МС_HTTPAPIКонструкторСервер.СписокТабличныхЧастей(Объект.КонструкторТипИсточника, Объект.КонструкторИмяОбъекта);
	Для Каждого Эл Из СписокТЧ Цикл
		Элементы.КонструкторИмяТабличнойЧасти.СписокВыбора.Добавить(Эл.Имя, Эл.Представление);
	КонецЦикла;
	
	ОбновитьСписокВыбораПоляОтбораКонструктораНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСравненияОтбора()
	
	Список = Элементы.ОтборыКонструктораСравнение.СписокВыбора;
	Список.Очистить();
	Список.Добавить("=");
	Список.Добавить("<>");
	Список.Добавить(">");
	Список.Добавить("<");
	Список.Добавить(">=");
	Список.Добавить("<=");
	Список.Добавить("ПОДОБНО");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораПоляОтбораКонструктораНаСервере()
	
	ИмяТаблицы = МС_HTTPAPIКонструкторСервер.ПолноеИмяТаблицыЗапроса(Объект.КонструкторТипИсточника, Объект.КонструкторИмяОбъекта, Объект.КонструкторИмяТабличнойЧасти);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) И ЗначениеЗаполнено(Объект.КонструкторИмяТаблицы) Тогда
		ИмяТаблицы = СокрЛП(Объект.КонструкторИмяТаблицы);
	КонецЕсли;
	ДопИмена = Новый Массив;
	Для Каждого Стр Из ОтборыКонструктора Цикл
		Если ЗначениеЗаполнено(Стр.Поле) Тогда
			ДопИмена.Добавить(Стр.Поле);
		КонецЕсли;
	КонецЦикла;
	МС_HTTPAPIКонструкторСервер.ЗаполнитьСписокВыбораПолейОтбора(ИмяТаблицы, Элементы.ОтборыКонструктораПоле.СписокВыбора, ДопИмена);
	
КонецПроцедуры

&НаСервере
Процедура КонструкторЗаполнитьПоляИзМетаданныхНаСервере()
	
	ИмяТаблицы = МС_HTTPAPIКонструкторСервер.ПолноеИмяТаблицыЗапроса(Объект.КонструкторТипИсточника, Объект.КонструкторИмяОбъекта, Объект.КонструкторИмяТабличнойЧасти);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	МС_HTTPAPIКонструкторСервер.ЗаполнитьТаблицуПолейПоМетаданным(ИмяТаблицы, ПоляКонструктора, Истина);
	ОбновитьСписокВыбораПоляОтбораКонструктораНаСервере();
	ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ТестВыполненияНаСервере(СсылкаНастройки)
	
	Возврат МС_HTTPAPIСервер.ВыполнитьНастройкуВТестовомРежиме(СсылкаНастройки);
	
КонецФункции

&НаСервере
Функция СформироватьПримерНаСервере(СсылкаНастройки)
	
	Возврат МС_HTTPAPIСервер.СформироватьПримерОтвета(СсылкаНастройки);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыИзТекстаЗапросаНаСервере()
	
	Имена = МС_HTTPAPIСервер.ИменаПараметровТекстаЗапроса(Объект.ТекстЗапроса);
	Объект.ПараметрыЗапроса.Очистить();
	Для Каждого Имя Из Имена Цикл
		СтрокаПараметра = Объект.ПараметрыЗапроса.Добавить();
		СтрокаПараметра.ИмяПараметра = Имя;
		СтрокаПараметра.Обязательный = Ложь;
	КонецЦикла;
	МС_HTTPAPIСервер.СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(Объект);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыИзОтборовКонструктораНаСервере()
	
	Если Объект.СпособПолученияДанных <> Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		Возврат "";
	КонецЕсли;
	КолвоСПараметром = 0;
	Для Каждого Стр Из ОтборыКонструктора Цикл
		Если ЗначениеЗаполнено(СокрЛП(Стр.ИмяПараметра)) Тогда
			КолвоСПараметром = КолвоСПараметром + 1;
		КонецЕсли;
	КонецЦикла;
	МС_HTTPAPIСервер.ЗаполнитьПараметрыЗапросаИзТаблицыОтборовКонструктора(Объект, ОтборыКонструктора);
	Если КолвоСПараметром = 0 Тогда
		Возврат "В отборах нет строк с заполненным «Параметр HTTP». "
			+ "Такие строки нужны, чтобы передать значение отбора из вызова API (query или тело). "
			+ "Фиксированное значение в «Значение (фикс.)» задаёт постоянный отбор без параметра - оно не попадает в список «Параметры API».";
	КонецЕсли;
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыAPIИзОтборовКонструктораЕслиНужноНаСервере()
	
	Если Объект.СпособПолученияДанных <> Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПараметрыИзОтборовКонструктораНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПараметровЗаписиJSONНаСервере()
	
	Список = Элементы.ЗаписьJSON_ПереносСтрок.СписокВыбора;
	Список.Очистить();
	Список.Добавить("Авто");
	Список.Добавить("Нет");
	Список.Добавить("Unix");
	Список.Добавить("Windows");
	
	СписокЭ = Элементы.ЗаписьJSON_ЭкранированиеСимволов.СписокВыбора;
	СписокЭ.Очистить();
	СписокЭ.Добавить("Нет");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыЗаписиJSONВФормуНаСервере()
	
	СФ = МС_HTTPAPIСервер.НастройкиЗаписиJSONВСтруктуруФормы(Объект.JSONПараметрыЗаписи);
	ЗаписьJSON_ПереносСтрок = СФ.ПереносСтрок;
	ЗаписьJSON_СимволыОтступа = СФ.СимволыОтступа;
	ЗаписьJSON_ИспользоватьДвойныеКавычки = СФ.ИспользоватьДвойныеКавычки;
	ЗаписьJSON_ЭкранированиеСимволов = СФ.ЭкранированиеСимволов;
	ЗаписьJSON_ЭкранироватьУгловыеСкобки = СФ.ЭкранироватьУгловыеСкобки;
	ЗаписьJSON_ЭкранироватьРазделительСтрок = СФ.ЭкранироватьРазделительСтрок;
	ЗаписьJSON_ЭкранироватьАмперсанд = СФ.ЭкранироватьАмперсанд;
	ЗаписьJSON_ЭкранироватьОдинарныеКавычки = СФ.ЭкранироватьОдинарныеКавычки;
	ЗаписьJSON_ЭкранироватьКавычки = СФ.ЭкранироватьКавычки;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПараметрыЗаписиJSONИзФормыКОбъекту(ОбъектНастройки)
	
	СФ = Новый Структура;
	СФ.Вставить("ПереносСтрок", ЗаписьJSON_ПереносСтрок);
	СФ.Вставить("СимволыОтступа", ЗаписьJSON_СимволыОтступа);
	СФ.Вставить("ИспользоватьДвойныеКавычки", ЗаписьJSON_ИспользоватьДвойныеКавычки);
	СФ.Вставить("ЭкранированиеСимволов", ЗаписьJSON_ЭкранированиеСимволов);
	СФ.Вставить("ЭкранироватьУгловыеСкобки", ЗаписьJSON_ЭкранироватьУгловыеСкобки);
	СФ.Вставить("ЭкранироватьРазделительСтрок", ЗаписьJSON_ЭкранироватьРазделительСтрок);
	СФ.Вставить("ЭкранироватьАмперсанд", ЗаписьJSON_ЭкранироватьАмперсанд);
	СФ.Вставить("ЭкранироватьОдинарныеКавычки", ЗаписьJSON_ЭкранироватьОдинарныеКавычки);
	СФ.Вставить("ЭкранироватьКавычки", ЗаписьJSON_ЭкранироватьКавычки);
	ОбъектНастройки.JSONПараметрыЗаписи = МС_HTTPAPIСервер.СтрокаНастроекЗаписиJSONИзСтруктурыФормы(СФ);
	
КонецПроцедуры

#КонецОбласти
